[
  {
    "source_file": "a_basic_meeting_etiquette_for_professionals.txt",
    "chunk_index": 0,
    "text": "Please take note of the below guidelines for all your client / prospect meetings Basic Meeting Etiquette & Preparation for Professionals\nAlways arrive at Prospect/Client Meetings at least 10 meetings before meeting time. Punctuality is very important and goes to show our personal work attitude. If you know you will be late for the meeting, please ensure you give the client a call to apologize and to inform them.\nWhen you are being ushered into meeting room to wait for clients, please take the seats in the opposite direction from the meeting room door. We will want to see and greet clients when they walk into the meeting room, hence do not sit at the seats with our back facing the door as it may be implied as rather rude.\nAlways stand up and smile warmly when you notice the client(s) has arrived and entering the meeting room. Have a friendly attitude.\nPlease do not pass your name card over the meeting table or wait for the client/prospect to walk up to your seats to greet you. Instead, always be pro-active and please walk up to the clients to shake their hand and pass your name card with both hands.\nInform the receptionist or office tea assistant to get help from their IT colleague to help setup the projector/AV system etc. if you would be doing a laptop presentation. Make sure audio plug to their system is working to ensure audio from your presentation can be heard in the meeting room as well.\nIt will be good to inform the client earlier in the email that our corporate presentation will need the projector/screen/sound etc. and if their meeting has the projector, and if they can standby their IT guy to assist with the set up if necessary.\nBefore you start your presentation, always thank the prospect/client first for their time today, introduce the prospect/client to your other colleagues (if you set up the meeting with client), and share a quick summary of what you will be covering first. Then you may proceed.."
  },
  {
    "source_file": "basic_telephone_skills.txt",
    "chunk_index": 0,
    "text": "Basic Telephone Skills @ Verztec Just as how Business Emails and Casual Emails are handled differently, phone calls at home or from your personal friends and at the office (*business calls) are different and should be handled differently. Outward follow‐up sales or project related calls should be scheduled to suit your timetable and that of your respondent. Inward calls should be professionally handled. Once you are using the telephone you need to develop some procedures that ensure you get the most out of each call and that you do not waste time at work. Scheduling outward calls At the beginning of each day: • make a list of the calls you have to make for the day • put them in order of priority (essential, desirable, those that can be rescheduled if necessary) • allocate times for each call trying, if possible, to bunch them and to bear in mind when each call is likely to be suitable for your respondent. Appropriate greetings and endings Appropriate greetings and endings to calls help build a good rapport and avoid misunderstandings and wasting time. The three elements of an appropriate greeting are: • pick the call with a greeting \"Good Morning Verztec\", \"Good Afternoon Verztec\" etc. • (Be sure to identify your company in the greeting) • Introduce your name and job title/department in the call (*Personalize the call) • Ask how you can help the caller Always check: • Caller's name, company's name, contact details and also note down the query When you close the call you should: • make sure that the caller has no more queries • thank the caller for his/her time • let the caller put down the receiver first so they don't feel you have cut them off. *Pls check with your department manager when in doubts Gathering information A telephone call is a purposeful activity. People do not call for no reasons, especially when it is business related. Your caller will have some objective in mind and you will need to elicit this objective as quickly and as clearly as possible. In a simple information‐seeking call, all you need to do is ask for the caller's name, company name, contact details and query. However, in more complex situations, you need to develop your questioning techniques so that you obtain the salient facts. Let's assume your caller has a complaint about a service your company has sold them. You need to: • ascertain the nature of the problem • verify that the product is one of yours and who is the person who handled the project • mention that you understand the frustration of the issue and apologize for the inconveniences this matter has caused, give him/her your assurance that you would look into the matter straight away and get back *Pls check with your department manager when in doubts Listening skills Another skill in receiving telephone calls is the ability to listen properly. Passive listening is simply allowing the caller to talk and not taking any action to ensure we have the right message. By actively listening we mean first indicating to the caller that we are listening by interrupting in an encouraging manner—interruptions could be 'yes', 'I see', 'Okay', 'right,' 'I know what you mean', or they could be prompts to encourage the caller to say more: 'is that true?', 'are you sure?', etc. And secondly we mean asking questions or using prompts to ensure that the caller gives precise information so that the message we receive is accurate. This can be done by the use of wh‐ questions: • What color?/how many?/when will you arrive?/where shall we meet? • And by techniques such as echoing and reformulating. Suggesting and verifying a course of action Once you have an accurate picture of the situation, you are in a position to propose a course of action to your caller. You should: • outline the proposal and check that it is acceptable to the caller • confirm that they understand what is to be done. Take notes If you are expect to handle a lot of calls each day, especially if you are on duty rotation, then it is essential to log each one under date and time. For all calls you should make a note of who rang, for what reason, and the action you agreed with times and details of address, telephone number etc. Dealing with difficult callers Sometimes a caller is very difficult, especially if complaining. First remember that this caller is a client, or potential client, so your handling of the call could result either in more business for our company or in the caller going to a competitor and never to come back. Whatever the nature of the problem, don't try to fob the caller off by disclaiming personal responsibility or by trying to pass the buck. What you should do is: • listen without interrupting • gather the facts and make a note of them • take their details so you can get back to them • sympathize with them and offer to act as fast as you can • apologize if you have made the mistake • stay calm even thought the caller is angry and possibly abusive. Telephone etiquette Just because you can't see the caller, it doesn't mean you have the right to suspend the normal rules of politeness. Be helpful to the caller even if the subject of the call is not strictly speaking your field of responsibility. This means trying to find someone who can help now, or someone who can ring them back later. Don't put the caller on hold and then leave them suspended there indefinitely. Remember too that you give out subliminal signals by the tone of your voice, the clarity with which you speak, how fast you speak, the pitch of your voice. You should always devote your full attention to the call; mistakes and misunderstandings will arise if you are doing something else at the same time. Even if the call is a difficult or heated one, stay calm; try to be helpful and never slam the phone down. Things to avoid when on the phone It's easy to fall into the trap of believing that because your caller can't see you, they won't be affected by what you are doing and what's going on around you. Remember not to: • let it ring more than three times • eat and drink while talking on the phone • be too familiar • talk to someone else in your office • have too much background noise • speak too quietly or too loudly • speak too quickly."
  },
  {
    "source_file": "offboarding_process_on_clean_desk_policy.txt",
    "chunk_index": 0,
    "text": "Date: 15th JAN 2025 Offboarding Clean Desk and Digital Handover Policy This policy outlines the steps employees must take to maintain a clean and organized workspace and ensure all necessary digital files are properly backed up and handed over before their final day of work. Clean Desk Policy Employees must ensure their workspace is clear of personal and unnecessary items by the end of their final working day. This includes:\nRemoval of Personal Belongings: o Take home all personal items such as photos, decorations, and personal stationery etc. o Check and empty all drawers, cabinets, and other storage areas for personal belongings. o Bring back/ throw away any food or drinks you stored in the office refrigerator.\nOrganizing Work Materials: o Sort through physical documents. Shred or dispose of sensitive documents no longer needed. Remove all name cards and old files outside the bin near the lift area. o Return all company property (e.g., laptop, keyboard, employment card, medical card, office keys etc) to the designated person or department. o Please ensure that sensitive documents are not left on display, which can cause data theft and leaks.\nDesk Equipment: o Do a clean up and leave the desk and its equipment (e.g., monitors, keyboards etc) clean and functional. Digital File Handover Employees must ensure that all relevant digital files are properly backed up and handed over. The following steps should be completed:\nBackup Necessary Files: o Transfer all work-related files to the designated shared drive or cloud storage. o Ensure files are organized logically in folders for easy access.\nHandover of Credentials: o Share login credentials for any work-related systems, tools, or platforms with the supervisor or IT department, if applicable.\nDelete Personal Files: o Identify and delete personal files from company devices (e.g., photos, personal documents, or non-work-related downloads). o Empty and permanently delete the trash/recycle bin to ensure complete removal.\nEmail and Communication Tools: o Archive important emails and share access with the relevant team members. o Seek advice from your team manager to forward your emails to staff taking over. o Log out of all personal accounts from company systems. Final Review\nSchedule a review with your supervisor or HR to: o Confirm the handover of all files and credentials. o Verify the return of company property. o Conduct a final check of the workspace.\nIT Department Involvement: o The IT team will review the digital handover to ensure compliance with company policies. Acknowledgment Employees must sign an Employment Clearance Form to confirm compliance with the policy and completion of all steps. Notice Non-compliance with this policy may result in delays in the clearance process and potential withholding of final payments until all obligations are met."
  },
  {
    "source_file": "policy_on_office_laptop_and_computer.txt",
    "chunk_index": 0,
    "text": "5th August 2020 Guidelines on Office Laptop and Computer All company laptops and desktop computers assigned to employee shall be deemed as company property, and each employee issued with a laptop or computer shall be responsible for the issued item. You are expected to treat company's property as if it's your own property with reasonable care. All employees are required to undertake the following actions as part of your responsibility: o For laptop users: Power off your laptop and switch off/ plug out the charger when not in use at the end of the day before leaving the office. Keeping your laptop plugged in all the time will kill its battery faster. This is compulsory to avoid overheating of laptop's adaptor (prevent possible fire) and also to prolong the lifespan of the battery. Please keep your laptop in your drawer before leaving the office. Do not leave it around. o For PC and MAC users: please turn off your computer and screen(s) when not in use at the end of the day. o All LCD screen monitors should be turned off to conserve power energy. This also applies to laptop users with additional LCD screens at your work desk. o For the public spare PC/ MAC, the last user should be responsible for its usage and care at the end of each working day. o If you need to turn on the office computers for WFH mode, please stick a \"Post it Pad\" indicating \"WORK FROM HOME USE, DO NOT TURN OFF\" so that other staff are aware. Please also wipe off any dust accumulated around your laptops/ computers with tissue for cleanliness. In case of any loss or damages, the management will investigate the root of cause and will update you on the outcome if any penalty is applicable. You are required to return the laptop/ computers in a reasonable good condition (except for fair wear and tear) when you leave the company."
  },
  {
    "source_file": "project_sign_off_and_change_acknowledgement_form_250227_.txt",
    "chunk_index": 0,
    "text": "PROJECT SIGN OFF AND CHANGE ACKNOWLEDGEMENT FORM\n\nThis form is intended to formally initiate the project and align key expectations and milestones to ensure its success. It fosters transparent communication, ensures a smooth workflow, and outlines the process for managing approvals and changes throughout the project's development. By signing this form, the Client Company acknowledges that  <Please confirm the following by checking each box:>  All phase approvals including GUI design, storyboard, audio/voice over scripts, course links, translations (where applicable) will be requested via email by Verztec’s project manager.   The Client Company will provide email or written confirmation to approve proceeding with the next phase of the project.\n\nAny changes requested after phase approval may incur additional costs and require timeline adjustments."
  },
  {
    "source_file": "sop_checklist_transcription_projects.txt",
    "chunk_index": 0,
    "text": "Transcription Quality & Accuracy Checklist\n\n1. Pre-Transcription Assessment Check audio quality: Background noise, distortions, low volume? Identify number of speakers & their clarity (accents, speech pace, overlapping)  Determine if there’s industry-specific jargon, slang, or acronyms.  Review any provided reference materials (glossaries, style guides, previous transcripts). 2. Handling Unclear or Inaudible Parts Use [inaudible hh:mm:ss] for completely unintelligible sections. If uncertain, provide the best guess with (?) (e.g., \"data migration (?)\"). Timestamp difficult sections for easier review (e.g., [unclear 00:02:15]). If multiple speakers are unclear, use [Speaker A], [Speaker B], etc. 3. Context & Consistency Checks Does the transcription make logical sense in context?  Are repeated terms consistent (e.g., names, key terms, abbreviations)? Cross-check unclear words with any available resources (e.g., company website, industry articles). 4. Formatting & Compliance Follow client’s style guide (verbatim vs. clean transcription, filler words, etc.). Maintain proper punctuation, capitalization, and speaker labels. Ensure time codes, headers, and notes are placed according to instructions. 5. Final Review & Client Clarifications Highlight sections that need confirmation or additional context. List key terms or names requiring verification. Request clarification from the client if guidance is insufficient.\n\nSpecial Note to client:\n\nThank you for entrusting us with this transcription/translation project. Due to the challenging audio quality, we will complete the work to the best of our ability. Any segments that are inaudible will be marked with timecodes for easy reference. As we were not present during the recording and do not have additional context, we seek your understanding that there may be some limitations in interpreting certain utterances. For instance, homophones (words that sound the same but have different meanings) may not always be distinguishable. To ensure the highest accuracy, we kindly request any relevant reference materials, preferred spellings, speaker names, or specific terminology before we begin. Your guidance will be greatly appreciated in achieving the best possible outcome. Please let us know if you have any questions or additional instructions. We look forward to working on this project."
  },
  {
    "source_file": "verztec_digital_meeting_etiquette.txt",
    "chunk_index": 0,
    "text": "Digital Meeting Etiquette Points to note for our internal meetings\nRespect the speakers -Please give your full attention in meeting session\nTurn Video on, so we know you are present & in the meeting. Check your video sound/image/good lighting before hand. Dress in Smart Casual when presenting to prospects/clients or external parties\nPlease refrain from doing other work/tasks. Eg.Hands typing away on keyboard or on your phone\nIf you have a question, concern or wish to speak, please mention in the private msg to the host\nPlease take notes so that you can remember the points to apply in your work"
  },
  {
    "source_file": "verztec_ownership_policy.txt",
    "chunk_index": 0,
    "text": "Verztec Ownership Policy We operate a Work Ownership Policy at Verztec. The main reasons for introducing this policy are: 1. It encourages employees to be detail-oriented, especially in capturing and understanding clients' requirements (*when dealing with clients' projects). 2. Better Quality Deliverables and Better Service Experience for our customers 3. Cultivates the corporate culture of re-confirming internally or with client when in doubts, when it comes to critical client's preferences and project/task requirements. (and to reduce internal miscommunication and misunderstanding) 4. It encourages a greater sense of ownership and accountability, especially in terms of cost management, at the workplace The Policy in Operation The implementation of the policy is straight-forward. In the course of work that you undertake in Verztec, at certain times you would be required to: (1) Perform tasks that involve sample demonstrations of the services Verztec offers (eg. sample translations, sample designed artwork or sample copy written text) for clients and prospects. (2) You may also be involved in requirements capture of details pertaining to client's projects so you can manage them or pass on to a project manager to handle it. (3) You may be tasked to design and/or perform edits for print outsourcing or you may be tasked to coordinate design and print related projects, and that your role requires you to provide specific and proper instructions to external printer vendors. (4) You may be tasked to search for resources and carefully select vendors for projects. These are important responsibilities and you are expected to take the highest level of ownership in making sure that the tasks are carried out well with the right procedure with careful checks. - In event that costs are incurred for services or project samples carried out without official management team approval (*eg. sample translations, sample designed artwork or sample copy written text), and that Verztec is liable to pay certain amount of fees; - Or if you misunderstood the client's requirements (inaccurate capture of client / prospect requirements) and failing to re-confirm the language pair or project requirements with client. (*eg. if a project has to be translated from English to Japanese, but u wrongly assigned it to a translator to translate it to English to Korean, - Or if a project has to be copy written in French but you had it done in German instead or you incur an unexpected increase of external printing costs occur due to oversight / careless design edits or updates whatsoever on your end); - Or in event that you asked the translator/vendors to proceed with the work and fee costs are incurred – without getting official management checks and approval of the purchase order (POs will be sent out in Verztec Xtranet for assigned projects indicating Management's Approval), and that the purchase order request was held back/stopped or to be altered from management due to whatever reasons, then the financial costs of the mistake and all the mentioned above, in this case will be bared by yourself. The key to doing this well is to treat the company's money as your own money. Treat the tasks that you handle in Verztec with care as if they are your own personal tasks! Handle them with pride and make sure you check carefully before moving to the next step. Kindly ask and re-confirm and seek approval from management if in doubts."
  },
  {
    "source_file": "verztec_pantry_rules.txt",
    "chunk_index": 0,
    "text": "VERZTEC PANTRY RULES PLEASE KEEP OUR PANTRY CLEAN & NEAT\nBe considerate and keep the sink area DRY after washing. Clean the water dispenser surface if you spill coffee/ tea on it.\nDISPOSE any unwanted items and tidy up the fridge.\nDISPOSE your left over food, boxes/ plastic containers OUTSIDE the office. When using the office's bin, please close the lid properly after disposal.\nCLEAN UP the countertops or tables with a damp cloth after you had your meal in the office. Be considerate by tidying up.\nPlease DO NOT cut the fruits or other food items on the kitchen top but using the available chopping boards. Thank you for your co-operation to a clean and insect free pantry environment! Management of Verztec"
  },
  {
    "source_file": "verztec_webmail_and_autoresponder.txt",
    "chunk_index": 0,
    "text": "Verztec Webmail\n\nWhen you are not in the office, you may access Verztec Webmail at this URL:\n\nhttp://webmail.verztec.com Userid: your email address Password: your password\n\nThis is useful when you need to check emails from home/ outside to reply to your clients/ suppliers.\n\nPlease do check emails regularly when you are accessing Internet at home.\n\nDo take note of there will be email relay problems when you send out. As always, please put yourself as one of the recipients to ensure the email REALLY went out.\n\nVerztec SMTP mail Server for use in office MS Outlook:\n\nIncoming and outgoing: mail.verztec.com  Username: Your email address. \u000b** Note: If you download mails to your home PC using MS Outlook, you will not be able to download the same emails using your office PC - MS Outlook, so please use Webmail from home to keep a copy of the mails. Note that once you’ve downloaded your emails to your Outlook, it will not keep a copy in the Webmail / Server anymore.\n\nIf you have problems sending out emails, please check your SMTP or Outgoing Mail Settings to mail.singnet.com.sg\n\nHow to set an Autoresponder:\n\nPlease set an Autoresponder for your email when you are away on leave.\n\nGo to SETTINGS( Auto- Responder  in Webmail, check the box on “Enable Auto-responder”, click on the tab “Auto-responder Message” and enter your Autoresponder Subject Title and Message.\n\nPlease remember to deactivate this option when you’re back to work."
  },
  {
    "source_file": ".txt",
    "chunk_index": 0,
    "text": "Date: 13/07/2020 How to import supplier e-invoice data file from xtranet to ABSS purchase transaction module As per normal procedure, go to “View Invoice” menu to Print a copy of the invoice with approve the e-invoice thereafter. The hard copy of invoice will be filed to unpaid creditor file after we have checked and confirmed that the e-invoice data has been imported to ABSS purchase transaction module successfully.\n\nAt Invoice Module, there would be 2 New Sub-Menus created under this module now.\n\nGenerate New ABSS File – This is use to generate invoice data file into ABSS file in csv format (excel format first) Exported ABSS File – After the invoice data file is being imported to ABSS, the data file will be moved from Generate New ABSS File menu to here as past record\n\nClick on “Generate New ABSS File” and you will see there is a list of e-invoice data file show at below Check on the box near to S/N as to select all invoices for importing Click “Generate All to ABSS” box at the bottom for generating in Excel format file\n\nThe Excel file will be download at top right Arrow there\n\nSave the file name by default in Excel Format. We will be using this excel file to copy and paste to “Notepad” for the conversion from excel data file into text data file (.txt) This is because ABSS only accept text data file for the import data Do note that for each time we can only select 10 invoice transactions, should you have more than 10 transactions, do the first ten and repeat the same steps for the next 10 invoices\n\nOpen your Excel file that you have generated from xtranet, highlight all the transaction in excel and copy to NotePad and save the file name with .txt Now, we are ready to import the text file to ABSS\n\nA Sample of the 10 nos of e-invoice text file format that we are going to import to ABSS Login to ABSS as Single user ONLY. Back-up your ABSS data file before you perform the data import (IMPORTANT)\n\nAt ABSS, Click -> File – Import Data – Purchase – Service Purchase (I couldn’t print screen of this step)\n\nThe box below will display. Just Click “Continue”\n\nInsert your text file that you had saved previously. Click “Open”\n\nThe box below will display. Select “Match All”\n\nThe “Matching Import Field” will be auto filled and displayed. Click “Import”\n\nThe box below will display after import data is completed.\n\nOut of 10 invoices imported, there were 8 records imported with warnings. This is correct as the import text file is designated without the inclusive of foreign currency exchange rate generated from xtranet. What we need to do is to open the respective supplier account at ABSS to check the invoices whether it is recorded successfully as compared to the hard copy we have printed"
  },
  {
    "source_file": ".txt",
    "chunk_index": 1,
    "text": " “Matching Import Field” will be auto filled and displayed. Click “Import”\n\nThe box below will display after import data is completed.\n\nOut of 10 invoices imported, there were 8 records imported with warnings. This is correct as the import text file is designated without the inclusive of foreign currency exchange rate generated from xtranet. What we need to do is to open the respective supplier account at ABSS to check the invoices whether it is recorded successfully as compared to the hard copy we have printed\n\nFor the 2 records skipped - We have to check these 2 records for the reason why it was not imported to ABSS by opening the “ABSSPlog.txt” file follow the path shown at C drive\n\nSince I am using the trial ABSS data file that I copied to my “C Drive” for testing, therefore we could locate the log file in the C drive. However, when we import the data into our actual ABSS data file stored at Account Server, then we should be able to locate the Log file at Account Server drive.\n\nOpen the Log file to find the detail of the 2 skipped records.\n\nIn this example\n\nError 192 – Duplicate Supplier Invoice Number Supplier Pimporn Sentira already have the Supplier invoice of “NA” recorded in the past invoice at ABSS purchase data already. Hence a duplicate invoice error was prompted.  In this case, we would have to record the supplier invoice into ABSS manually base on the hard copy we printed on hand.  As usual, the NA stated in the supplier invoice will replace key for the #1st PO number in the supplier Inv# field in the ABSS. This can avoid the future similar error occur\n\nError 240 – Supplier not found This is New Supplier which we do not have New Supplier Card ID created in our ABSS data before. Hence, we would have to create new card ID in ABSS and record the invoice manually. To reduce this error, we could just create the New Supplier Card ID at ABSS data file first based on the hardcopy of invoice printed on hand before we perform the data import"
  }
]